In [2]:
import numpy as np
import pandas as pd

In [103]:
train = pd.read_csv('train.csv')
train_original = train.copy()

In [104]:
train.shape

(550068, 12)

In [105]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [106]:
Product_Category_2 = train[train['Product_Category_2'].isna()]

In [107]:
Product_Category_2.shape

(173638, 12)

In [108]:
train_P2 = train.drop(['User_ID','Product_Category_3'], axis=1) 
train_P2 = train_P2.dropna()
train_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase
1,P00248942,F,0-17,10,A,2,0,1,6.0,15200
3,P00085442,F,0-17,10,A,2,0,12,14.0,1057
5,P00193542,M,26-35,15,A,3,0,1,2.0,15227
6,P00184942,M,46-50,7,B,2,1,1,8.0,19215
7,P00346142,M,46-50,7,B,2,1,1,15.0,15854

In [109]:
train_P2.shape

(376430, 10)

In [110]:
train_P2_codes = train_P2.drop(['Purchase','Product_Category_2'],axis=1) 
for col in train_P2_codes.columns:  
    train_P2_codes[col] = train_P2_codes[col].astype('category') 
    train_P2_codes[col] = train_P2_codes[col].cat.codes

train_P2_codes.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
1,1229,0,0,10,0,2,0,0
3,416,0,0,10,0,2,0,11
5,958,1,2,15,0,3,0,0
6,889,1,4,7,1,2,1,0
7,1646,1,4,7,1,2,1,0

In [111]:
train_P2_codes_copy = train_P2_codes.copy()
train_P2_left = train_P2.drop(['Product_ID','Gender','Age','Occupation','City_Category','Stay_In_Current_City_Years','Marital_Status','Product_Category_1'],axis=1)
train_P2_codes = pd.concat([train_P2_codes,train_P2_left],axis=1)
train_P2_codes.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase
1,1229,0,0,10,0,2,0,0,6.0,15200
3,416,0,0,10,0,2,0,11,14.0,1057
5,958,1,2,15,0,3,0,0,2.0,15227
6,889,1,4,7,1,2,1,0,8.0,19215
7,1646,1,4,7,1,2,1,0,15.0,15854

In [3]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [113]:
Product_Category_2.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871
11,1000005,P00014542,M,26-35,20,A,1,1,8,NaN,NaN,3957

In [114]:
test_P2 = Product_Category_2.drop(['User_ID','Product_Category_2','Product_Category_3'],axis=1)
test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase
0,P00069042,F,0-17,10,A,2,0,3,8370
2,P00087842,F,0-17,10,A,2,0,12,1422
4,P00285442,M,55+,16,C,4+,0,8,7969
9,P00274942,M,26-35,20,A,1,1,8,7871
11,P00014542,M,26-35,20,A,1,1,8,3957

In [115]:
test_P2.shape

(173638, 9)

In [116]:
test_P2_purchase = test_P2['Purchase']
test_P2 = test_P2.drop(['Purchase'],axis=1)
for col in test_P2.columns:  
    test_P2[col] = test_P2[col].astype('category') 
    test_P2[col] = test_P2[col].cat.codes

test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
0,331,0,0,10,0,2,0,2
2,421,0,0,10,0,2,0,11
4,1344,1,6,16,2,4,0,7
9,1282,1,2,20,0,1,1,7
11,63,1,2,20,0,1,1,7

In [117]:
test_P2.shape

(173638, 8)

In [118]:
X_train = train_P2_codes.drop(['Product_Category_2'], axis=1)
y_train = train_P2_codes['Product_Category_2']

model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [119]:
test_P2['Purchase'] = test_P2_purchase
test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase
0,331,0,0,10,0,2,0,2,8370
2,421,0,0,10,0,2,0,11,1422
4,1344,1,6,16,2,4,0,7,7969
9,1282,1,2,20,0,1,1,7,7871
11,63,1,2,20,0,1,1,7,3957

In [120]:
predicted = np.round(model.predict(test_P2))
predicted

array([ 8., 16., 14., ..., 23., 24., 23.])

In [121]:
train_P2_codes.shape

(376430, 10)

In [122]:
len(predicted)

173638

In [123]:
test_P2['Product_Category_2'] = predicted

test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase,Product_Category_2
0,331,0,0,10,0,2,0,2,8370,8.0
2,421,0,0,10,0,2,0,11,1422,16.0
4,1344,1,6,16,2,4,0,7,7969,14.0
9,1282,1,2,20,0,1,1,7,7871,13.0
11,63,1,2,20,0,1,1,7,3957,13.0

In [125]:
trainP2 = train_P2_codes.append(test_P2)
trainP2['Product_Category_3'] = train['Product_Category_3']
trainP2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
1,1229,0,0,10,0,2,0,0,6.0,15200,14.0
3,416,0,0,10,0,2,0,11,14.0,1057,NaN
5,958,1,2,15,0,3,0,0,2.0,15227,NaN
6,889,1,4,7,1,2,1,0,8.0,19215,17.0
7,1646,1,4,7,1,2,1,0,15.0,15854,NaN

In [126]:
trainP2.shape

(550068, 11)

In [127]:
trainP2.to_csv("train1.csv")

SAME Process for TEST DAta

In [4]:
test = pd.read_csv('test.csv')
test_original = test.copy()

In [5]:
Product_Category_2 = test[test['Product_Category_2'].isna()]
train_P2 = test.drop(['User_ID','Product_Category_3'], axis=1) 
train_P2 = train_P2.dropna()
train_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,P00128942,M,46-50,7,B,2,1,1,11.0
1,P00113442,M,26-35,17,C,0,0,3,5.0
2,P00288442,F,36-45,1,B,4+,1,5,14.0
3,P00145342,F,36-45,1,B,4+,1,4,9.0
4,P00053842,F,26-35,1,C,1,0,4,5.0

In [7]:
train_P2_codes = train_P2.drop(['Product_Category_2'],axis=1) 
for col in train_P2_codes.columns:  
    train_P2_codes[col] = train_P2_codes[col].astype('category') 
    train_P2_codes[col] = train_P2_codes[col].cat.codes

train_P2_codes.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
0,588,1,4,7,1,2,1,0
1,505,1,2,17,2,0,0,2
2,1372,0,3,1,1,4,1,4
3,662,0,3,1,1,4,1,3
4,274,0,2,1,2,1,0,3

In [8]:
train_P2_codes_copy = train_P2_codes.copy()
train_P2_left = train_P2.drop(['Product_ID','Gender','Age','Occupation','City_Category','Stay_In_Current_City_Years','Marital_Status','Product_Category_1'],axis=1)
train_P2_codes = pd.concat([train_P2_codes,train_P2_left],axis=1)
train_P2_codes.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,588,1,4,7,1,2,1,0,11.0
1,505,1,2,17,2,0,0,2,5.0
2,1372,0,3,1,1,4,1,4,14.0
3,662,0,3,1,1,4,1,3,9.0
4,274,0,2,1,2,1,0,3,5.0

In [9]:
test_P2 = Product_Category_2.drop(['User_ID','Product_Category_2','Product_Category_3'],axis=1)
test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
11,P00040042,M,26-35,7,B,2,1,5
16,P00121042,M,46-50,3,A,1,1,15
20,P00303042,M,26-35,3,B,0,0,5
24,P00357242,F,46-50,16,A,1,1,5
34,P00119242,F,36-45,3,A,1,0,18

In [11]:
#test_P2 = test_P2.drop(['Purchase'],axis=1)
for col in test_P2.columns:  
    test_P2[col] = test_P2[col].astype('category') 
    test_P2[col] = test_P2[col].cat.codes

test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
11,182,1,2,7,1,2,1,4
16,514,1,4,3,0,1,1,13
20,1387,1,2,3,1,0,0,4
24,1623,0,4,16,0,1,1,4
34,507,0,3,3,0,1,0,16

In [12]:
X_train = train_P2_codes.drop(['Product_Category_2'], axis=1)
y_train = train_P2_codes['Product_Category_2']

model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [14]:
#test_P2['Purchase'] = test_P2_purchase
test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1
11,182,1,2,7,1,2,1,4
16,514,1,4,3,0,1,1,13
20,1387,1,2,3,1,0,0,4
24,1623,0,4,16,0,1,1,4
34,507,0,3,3,0,1,0,16

In [15]:
predicted = np.round(model.predict(test_P2))
predicted

array([10., 18., 11., ..., 13., 13., 13.])

In [16]:
test_P2['Product_Category_2'] = predicted

test_P2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
11,182,1,2,7,1,2,1,4,10.0
16,514,1,4,3,0,1,1,13,18.0
20,1387,1,2,3,1,0,0,4,11.0
24,1623,0,4,16,0,1,1,4,11.0
34,507,0,3,3,0,1,0,16,20.0

In [18]:
trainP2 = train_P2_codes.append(test_P2)
trainP2['Product_Category_3'] = test['Product_Category_3']
trainP2.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,588,1,4,7,1,2,1,0,11.0,NaN
1,505,1,2,17,2,0,0,2,5.0,NaN
2,1372,0,3,1,1,4,1,4,14.0,NaN
3,662,0,3,1,1,4,1,3,9.0,NaN
4,274,0,2,1,2,1,0,3,5.0,12.0

In [19]:
trainP2.to_csv("test1.csv")

In [20]:
trainP2.shape

(233599, 10)

In [21]:
test.shape

(233599, 11)